import './viewer.css';
import { useState } from 'react';

function Viewer() {

  let 화산천마1화 = {
    표지: "https://dn-img-page.kakao.com/download/resource?kid=c1XI7C/hyfOmUlIKc/L1QT80gscUr3KbeQKhO0bk",
    쪽: ["1쪽좌", "1쪽우", "2쪽좌", "2쪽우", "3쪽좌", "3쪽우", "4쪽좌", "5쪽우",
      "6쪽좌", "6쪽우", "7쪽좌", "7쪽우", "8쪽좌", "8쪽우", "9쪽좌", "9쪽우",
      "10쪽좌", "10쪽우", "11쪽좌", "11쪽우", "12쪽좌", "12쪽우",]
  }

  let 컨텐츠홈 = "data:image/svg+xml,%3csvg width='24' height='24' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cpath d='M10.7552 3.17711C11.1549 2.93817 11.6542 2.9412 12.051 3.18498L19.9314 8.02706L20.7167 6.74904L12.8363 1.90696C11.9634 1.37064 10.8648 1.36396 9.98549 1.88965L2.83889 6.16218C2.00844 6.65865 1.5 7.555 1.5 8.52253V19.7509C1.5 21.2697 2.73122 22.5009 4.25 22.5009H7.44938V21.0009H4.25C3.55964 21.0009 3 20.4413 3 19.7509V8.52253C3 8.08275 3.23111 7.67531 3.60858 7.44965L10.7552 3.17711Z' fill='%23222222'/%3e %3cpath d='M11 12.5C11 11.9477 11.4477 11.5 12 11.5C12.5523 11.5 13 11.9477 13 12.5C13 13.0523 12.5523 13.5 12 13.5C11.4477 13.5 11 13.0523 11 12.5Z' fill='%23222222'/%3e %3cpath d='M22.5 13.25H14.5V11.75H22.5V13.25Z' fill='%23222222'/%3e %3cpath d='M14.5 17.5H22.5V16H14.5V17.5Z' fill='%23222222'/%3e %3cpath d='M11 16.75C11 16.1977 11.4477 15.75 12 15.75C12.5523 15.75 13 16.1977 13 16.75C13 17.3023 12.5523 17.75 12 17.75C11.4477 17.75 11 17.3023 11 16.75Z' fill='%23222222'/%3e %3cpath d='M14.5 21.75H22.5V20.25H14.5V21.75Z' fill='%23222222'/%3e %3cpath d='M11 21C11 20.4477 11.4477 20 12 20C12.5523 20 13 20.4477 13 21C13 21.5523 12.5523 22 12 22C11.4477 22 11 21.5523 11 21Z' fill='%23222222'/%3e %3c/svg%3e";
  let 정주행 = "data:image/svg+xml,%3csvg width='24' height='24' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cpath fill-rule='evenodd' clip-rule='evenodd' d='M20.3967 2C18.7437 2 17.4038 3.30374 17.4038 4.9118C17.4038 6.51987 18.7437 7.82361 20.3967 7.82361C22.0497 7.82361 23.3896 6.51987 23.3896 4.9118C23.3896 3.30374 22.0497 2 20.3967 2ZM18.9003 4.9118C18.9003 4.10757 19.5703 3.45577 20.3967 3.45577C21.2231 3.45577 21.8931 4.10757 21.8931 4.9118C21.8931 5.71604 21.2231 6.36784 20.3967 6.36784C19.5703 6.36784 18.9003 5.71604 18.9003 4.9118Z' fill='%23222222'/%3e %3cpath d='M8.06851 5.39594C8.13572 5.32403 8.23189 5.22592 8.35493 5.11261C8.59975 4.88714 8.95785 4.59506 9.41253 4.32966C10.3232 3.7981 11.6695 3.35001 13.2493 3.83031C15.5481 4.52918 16.2803 6.20107 16.8789 7.56807C17.006 7.85815 17.127 8.1345 17.2557 8.38491C17.6403 9.13317 18.1061 9.77116 18.9374 10.2424C19.7854 10.7232 21.0952 11.076 23.2518 11.076H24V12.5318H23.2518C20.9441 12.5318 19.3421 12.1568 18.1839 11.5002C17.271 10.9827 16.6843 10.3186 16.2535 9.63086C16.1781 9.6644 16.0891 9.7045 15.9889 9.75058C15.6522 9.9054 15.1917 10.1263 14.6957 10.3905C13.9051 10.8118 13.0985 11.3055 12.5392 11.7863C12.5994 11.8344 12.666 11.8866 12.7392 11.9427C13.1731 12.2754 13.7561 12.6875 14.3724 13.1232L14.6181 13.297C15.3122 13.7881 16.029 14.2997 16.5542 14.7215C16.8128 14.9292 17.0532 15.1374 17.2244 15.3247C17.3063 15.4142 17.4063 15.5351 17.4771 15.6758C17.5302 15.7813 17.6845 16.1323 17.4594 16.4963L17.4363 16.5336L17.4089 16.568C15.5837 18.8509 13.617 20.1316 12.0906 20.8418C11.3287 21.1963 10.678 21.408 10.211 21.5319C9.97748 21.5938 9.78961 21.6339 9.65637 21.659C9.33613 21.7192 9.00967 21.7468 8.68646 21.7862L8.50085 20.3417C8.79085 20.3062 9.08511 20.2837 9.3724 20.2296C9.47103 20.2111 9.62219 20.1792 9.8173 20.1274C10.2077 20.0238 10.7728 19.8412 11.445 19.5285C12.6961 18.9464 14.3233 17.9111 15.8885 16.0841C15.8089 16.014 15.7133 15.9339 15.6015 15.8441C15.118 15.4558 14.4396 14.9709 13.7378 14.4742L13.4925 14.3007C12.8814 13.8688 12.2717 13.4378 11.8129 13.086C11.5562 12.8892 11.3203 12.6973 11.153 12.532C11.0748 12.4549 10.9738 12.3471 10.8987 12.2223C10.862 12.1612 10.803 12.0503 10.7803 11.9049C10.7549 11.7425 10.7733 11.5054 10.9481 11.2956C11.657 10.4445 12.955 9.65825 13.9769 9.11375C14.5054 8.8321 14.9936 8.59804 15.3495 8.43442C15.4327 8.39615 15.5088 8.36167 15.5767 8.33126C15.5181 8.20356 15.4618 8.07875 15.407 7.95693C14.8229 6.6604 14.3915 5.70273 12.803 5.21981C11.7588 4.90237 10.8605 5.18218 10.1825 5.57795C9.84283 5.77621 9.57062 5.99765 9.3837 6.16979C9.29087 6.25528 9.22082 6.327 9.17577 6.37521C8.98975 6.57427 8.82413 6.79456 8.65038 7.00429L7.48483 6.09128C7.67764 5.85889 7.86223 5.61667 8.06851 5.39594Z' fill='%23222222'/%3e %3cpath d='M9.72994 13.7682L10.3042 13.3016L9.34491 12.1843L8.77065 12.6509C6.35635 14.6127 4.2881 16.5723 2.82396 18.0406C2.09145 18.7752 1.50903 19.388 1.10892 19.818C0.908837 20.033 0.754271 20.2025 0.649243 20.3187C0.596727 20.3768 0.556589 20.4216 0.529334 20.4522C0.352083 20.6518 0.176184 20.8525 0 21.053L1.13657 22L1.65974 21.4061C1.68488 21.3779 1.72283 21.3355 1.7731 21.2799C1.87364 21.1686 2.0234 21.0045 2.21837 20.7949C2.60837 20.3757 3.17896 19.7754 3.89806 19.0542C5.33717 17.611 7.36656 15.6886 9.72994 13.7682Z' fill='%23222222'/%3e %3c/svg%3e"
  let 댓글 = "data:image/svg+xml,%3csvg width='24' height='24' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cpath fill-rule='evenodd' clip-rule='evenodd' d='M1.50098 10.5375C1.50098 5.43655 6.32081 1.5 12.0008 1.5C17.6808 1.5 22.5006 5.43655 22.5006 10.5375C22.5006 15.6384 17.6808 19.5749 12.0008 19.5749C11.5334 19.5749 11.0729 19.5486 10.6211 19.4976L6.06226 22.3833C5.83124 22.5295 5.53895 22.5384 5.29943 22.4066C5.05992 22.2747 4.91113 22.023 4.91113 21.7496V17.2065C2.83742 15.5725 1.50098 13.2044 1.50098 10.5375ZM12.0008 3C6.91142 3 3.00098 6.48429 3.00098 10.5375C3.00098 12.7796 4.17652 14.8251 6.10261 16.2276C6.29647 16.3688 6.41113 16.5941 6.41113 16.8339V20.3872L10.0459 18.0865C10.1952 17.992 10.3731 17.9533 10.5482 17.9771C11.0206 18.0414 11.5058 18.0749 12.0008 18.0749C17.0901 18.0749 21.0006 14.5906 21.0006 10.5375C21.0006 6.48429 17.0901 3 12.0008 3Z' fill='%23222222'/%3e %3c/svg%3e";
  let nav이전 = "data:image/svg+xml,%3csvg width='24' height='24' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cpath fill-rule='evenodd' clip-rule='evenodd' d='M15.9365 22.0007L6.00297 12.0001L15.9365 1.99943L17.0007 3.05651L8.11719 12.0001L17.0007 20.9436L15.9365 22.0007Z' fill='%23222222'/%3e %3c/svg%3e";
  let nav다음 = "data:image/svg+xml,%3csvg width='24' height='24' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cpath fill-rule='evenodd' clip-rule='evenodd' d='M8.06423 22.0007L17.9978 12.0001L8.06422 1.99943L7 3.05651L15.8835 12.0001L7 20.9436L8.06423 22.0007Z' fill='%23222222'/%3e %3c/svg%3e";
  let 커버 = "https://dn-img-page.kakao.com/download/resource?kid=c1XI7C/hyfOmUlIKc/L1QT80gscUr3KbeQKhO0bk";

  let content이전 = "data:image/svg+xml,%3csvg width='32' height='32' viewBox='0 0 32 32' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cg clip-path='url(%23clip0_5308_49633)'%3e %3cpath d='M6 15.9996L22.9132 32.0017L24.0028 30.9708L8.17921 15.9996L24.0028 1.02846L22.9132 -0.00244141L6 15.9996Z' fill='%23222222'/%3e %3c/g%3e %3cdefs%3e %3cclipPath id='clip0_5308_49633'%3e %3crect width='32' height='32' fill='white'/%3e %3c/clipPath%3e %3c/defs%3e %3c/svg%3e";
  let content다음 = "data:image/svg+xml,%3csvg width='32' height='32' viewBox='0 0 32 32' fill='none' xmlns='http://www.w3.org/2000/svg'%3e %3cg clip-path='url(%23clip0_5308_49689)'%3e %3cpath d='M25 15.9996L8.08678 32.0017L6.99718 30.9708L22.8208 15.9996L6.99718 1.02846L8.08678 -0.00244141L25 15.9996Z' fill='%23222222'/%3e %3c/g%3e %3cdefs%3e %3cclipPath id='clip0_5308_49689'%3e %3crect width='32' height='32' fill='white'/%3e %3c/clipPath%3e %3c/defs%3e %3c/svg%3e";
  //nav 토글 방식용 switch state
  let [navSwitch, setNavSwitch] = useState(true);

  //쪽수 state
  let [page, setPage] = useState(0);

  return (
    <div className="App">
      {navSwitch == true ?
        <div className='viewer-navbar flex'>
          <div className='viewer-navbar__1 flex'>
            <div className='viewer-navbar__1-flex flex'>
              <img src={컨텐츠홈} className='viewer-navbar__1__home _24px flex-세로중간정렬' />
              <span className='viewer-navbar__1__name flex-세로중간정렬'>화산천마 1화</span>
            </div>
          </div>
          <div></div>
          <div className='viewer-navbar__2 flex'>
            <div className='flex'>
              <img src={정주행} className='viewer-navbar__2__정주행 _24px flex-세로중간정렬' />
            </div>
            <div className='flex'>
              <img src={댓글} className='viewer-navbar__2__댓글 _24px flex-세로중간정렬' />
            </div>
          </div>
          <div className='viewer-navbar__3 flex'>
            <div className='flex'>
              <img src={nav이전} className='_24px flex-세로중간정렬' />
              <div className='flex-세로중간정렬'>이전화</div>
            </div>
            <div className='flex'>
              <div className='flex-세로중간정렬'>다음화</div>
              <img src={nav다음} className='_24px flex-세로중간정렬' />
            </div>
          </div>
        </div>
        : null}


      <div className='viewer__content flex' onClick={() => {
        //클릭시 nav 토글로 생겼다 없어졌다
        setNavSwitch(!navSwitch);
      }}>
        <div className='viewer__content__prev-btn flex'>
          <img
            src={content이전}
            className='flex-세로중간정렬'
            onClick={() => {
              if (page > 0) {
                setPage(page - 1);
                console.log(page);
              }

            }} />
        </div>
        <div className='viewer__content__novel'>
          < PageRender page={page} setPage={setPage} 커버={커버} />
        </div>
        <div className='viewer__content__next-btn flex'>
          <img
            src={content다음}
            className='flex-세로중간정렬'
            onClick={() => {
              if (page < 12) {
                setPage(page + 1);
                console.log(page);
              }
            }}
          />
        </div>
      </div>


    </div>
  );
}

function PageRender(props) {
  if (props.page == 0) {
    return (

      <>
        <div className='viewer__content__novel-left'>
          <div className='커버-container'>
            <img src={props.커버} className='커버' />
          </div>
        </div>
        <div className='viewer__content__novel-rigth'>
        </div>
      </>

    )

  } else {
    return (
      <div>
        1. 캐러셀 형식으로 만들어야함
        2. 배열로 인덱스갯수 + 1(마무리칸)
        3. (i + 1) * page칸 크기로 전체 랜더링
        4. page칸 오버플로우 히든으로 감추기
        5. 캐러셀(useState로 상태 표시) 만들기

      </div>
    )

  }
}

export { Viewer }
